graph(%self.1 : __torch__.yolox.models.yolox.YOLOX,
      %x.1 : Float(1, 3, 416, 416, strides=[519168, 173056, 416, 1], requires_grad=0, device=cpu)):
  %head : __torch__.yolox.models.yolo_head.YOLOXHead = prim::GetAttr[name="head"](%self.1)
  %backbone : __torch__.yolox.models.yolo_pafpn.YOLOPAFPN = prim::GetAttr[name="backbone"](%self.1)
  %9 : float = prim::Constant[value=2.](), scope: __module.backbone/__module.backbone.upsample # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:3973:0
  %10 : bool = prim::Constant[value=1](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %11 : bool = prim::Constant[value=0](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %12 : NoneType = prim::Constant(), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.conv
  %13 : float = prim::Constant[value=0.001](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %14 : float = prim::Constant[value=0.029999999999999999](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %15 : int = prim::Constant[value=1](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:198:0
  %16 : int = prim::Constant[value=3](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:197:0
  %17 : int = prim::Constant[value=9223372036854775807](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:197:0
  %18 : int = prim::Constant[value=0](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:197:0
  %19 : int = prim::Constant[value=2](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:197:0
  %20 : int = prim::Constant[value=16](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.dconv/__module.backbone.backbone.dark2.0.dconv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %21 : int = prim::Constant[value=32](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.dconv/__module.backbone.backbone.dark3.0.dconv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %22 : int = prim::Constant[value=64](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark4/__module.backbone.backbone.dark4.0/__module.backbone.backbone.dark4.0.dconv/__module.backbone.backbone.dark4.0.dconv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %23 : int = prim::Constant[value=5](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark5/__module.backbone.backbone.dark5.1/__module.backbone.backbone.dark5.1.m.0 # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:791:0
  %24 : int = prim::Constant[value=4](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark5/__module.backbone.backbone.dark5.1/__module.backbone.backbone.dark5.1.m.1 # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:791:0
  %25 : int = prim::Constant[value=9](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark5/__module.backbone.backbone.dark5.1/__module.backbone.backbone.dark5.1.m.1 # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:791:0
  %26 : int = prim::Constant[value=6](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark5/__module.backbone.backbone.dark5.1/__module.backbone.backbone.dark5.1.m.2 # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:791:0
  %27 : int = prim::Constant[value=13](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark5/__module.backbone.backbone.dark5.1/__module.backbone.backbone.dark5.1.m.2 # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:791:0
  %28 : int = prim::Constant[value=128](), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark5/__module.backbone.backbone.dark5.0/__module.backbone.backbone.dark5.0.dconv/__module.backbone.backbone.dark5.0.dconv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %C3_n4 : __torch__.yolox.models.network_blocks.___torch_mangle_351.CSPLayer = prim::GetAttr[name="C3_n4"](%backbone)
  %bu_conv1 : __torch__.yolox.models.network_blocks.___torch_mangle_323.DWConv = prim::GetAttr[name="bu_conv1"](%backbone)
  %C3_n3 : __torch__.yolox.models.network_blocks.___torch_mangle_314.CSPLayer = prim::GetAttr[name="C3_n3"](%backbone)
  %bu_conv2 : __torch__.yolox.models.network_blocks.___torch_mangle_286.DWConv = prim::GetAttr[name="bu_conv2"](%backbone)
  %C3_p3 : __torch__.yolox.models.network_blocks.___torch_mangle_277.CSPLayer = prim::GetAttr[name="C3_p3"](%backbone)
  %reduce_conv1 : __torch__.yolox.models.network_blocks.___torch_mangle_249.BaseConv = prim::GetAttr[name="reduce_conv1"](%backbone)
  %C3_p4 : __torch__.yolox.models.network_blocks.___torch_mangle_245.CSPLayer = prim::GetAttr[name="C3_p4"](%backbone)
  %upsample : __torch__.torch.nn.modules.upsampling.Upsample = prim::GetAttr[name="upsample"](%backbone)
  %lateral_conv0 : __torch__.yolox.models.network_blocks.___torch_mangle_217.BaseConv = prim::GetAttr[name="lateral_conv0"](%backbone)
  %backbone.1 : __torch__.yolox.models.darknet.CSPDarknet = prim::GetAttr[name="backbone"](%backbone)
  %dark5 : __torch__.torch.nn.modules.container.___torch_mangle_213.Sequential = prim::GetAttr[name="dark5"](%backbone.1)
  %dark4 : __torch__.torch.nn.modules.container.___torch_mangle_165.Sequential = prim::GetAttr[name="dark4"](%backbone.1)
  %dark3 : __torch__.torch.nn.modules.container.___torch_mangle_99.Sequential = prim::GetAttr[name="dark3"](%backbone.1)
  %dark2 : __torch__.torch.nn.modules.container.___torch_mangle_33.Sequential = prim::GetAttr[name="dark2"](%backbone.1)
  %stem : __torch__.yolox.models.network_blocks.Focus = prim::GetAttr[name="stem"](%backbone.1)
  %conv.3 : __torch__.yolox.models.network_blocks.BaseConv = prim::GetAttr[name="conv"](%stem)
  %45 : Float(1, 3, 208, 416, strides=[519168, 173056, 832, 1], requires_grad=0, device=cpu) = aten::slice(%x.1, %19, %18, %17, %19), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:197:0
  %patch_top_left : Float(1, 3, 208, 208, strides=[519168, 173056, 832, 2], requires_grad=0, device=cpu) = aten::slice(%45, %16, %18, %17, %19), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:197:0
  %47 : Float(1, 3, 208, 416, strides=[519168, 173056, 832, 1], requires_grad=0, device=cpu) = aten::slice(%x.1, %19, %18, %17, %19), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:198:0
  %patch_top_right : Float(1, 3, 208, 208, strides=[519168, 173056, 832, 2], requires_grad=0, device=cpu) = aten::slice(%47, %16, %15, %17, %19), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:198:0
  %49 : Float(1, 3, 208, 416, strides=[519168, 173056, 832, 1], requires_grad=0, device=cpu) = aten::slice(%x.1, %19, %15, %17, %19), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:199:0
  %patch_bot_left : Float(1, 3, 208, 208, strides=[519168, 173056, 832, 2], requires_grad=0, device=cpu) = aten::slice(%49, %16, %18, %17, %19), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:199:0
  %51 : Float(1, 3, 208, 416, strides=[519168, 173056, 832, 1], requires_grad=0, device=cpu) = aten::slice(%x.1, %19, %15, %17, %19), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:200:0
  %patch_bot_right : Float(1, 3, 208, 208, strides=[519168, 173056, 832, 2], requires_grad=0, device=cpu) = aten::slice(%51, %16, %15, %17, %19), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:200:0
  %53 : Tensor[] = prim::ListConstruct(%patch_top_left, %patch_bot_left, %patch_top_right, %patch_bot_right), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem
  %input.1 : Float(1, 12, 208, 208, strides=[519168, 43264, 208, 1], requires_grad=0, device=cpu) = aten::cat(%53, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:201:0
  %act.1 : __torch__.torch.nn.modules.activation.SiLU = prim::GetAttr[name="act"](%conv.3)
  %bn.1 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="bn"](%conv.3)
  %conv.1 : __torch__.torch.nn.modules.conv.Conv2d = prim::GetAttr[name="conv"](%conv.3)
  %weight.435 : Tensor = prim::GetAttr[name="weight"](%conv.1)
  %59 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.conv
  %60 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.conv
  %61 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.conv
  %62 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.conv
  %input.3 : Float(1, 16, 208, 208, strides=[692224, 43264, 208, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.1, %weight.435, %12, %59, %60, %61, %11, %62, %15, %11, %11, %10, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %running_var.209 : Tensor = prim::GetAttr[name="running_var"](%bn.1)
  %running_mean.209 : Tensor = prim::GetAttr[name="running_mean"](%bn.1)
  %bias.227 : Tensor = prim::GetAttr[name="bias"](%bn.1)
  %weight.437 : Tensor = prim::GetAttr[name="weight"](%bn.1)
  %input.5 : Float(1, 16, 208, 208, strides=[692224, 43264, 208, 1], requires_grad=1, device=cpu) = aten::batch_norm(%input.3, %weight.437, %bias.227, %running_mean.209, %running_var.209, %11, %14, %13, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %input.7 : Float(1, 16, 208, 208, strides=[692224, 43264, 208, 1], requires_grad=1, device=cpu) = aten::silu_(%input.5), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.stem/__module.backbone.backbone.stem.conv/__module.backbone.backbone.stem.conv.act # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2076:0
  %_1.1 : __torch__.yolox.models.network_blocks.CSPLayer = prim::GetAttr[name="1"](%dark2)
  %_0.1 : __torch__.yolox.models.network_blocks.DWConv = prim::GetAttr[name="0"](%dark2)
  %pconv.1 : __torch__.yolox.models.network_blocks.___torch_mangle_7.BaseConv = prim::GetAttr[name="pconv"](%_0.1)
  %dconv.1 : __torch__.yolox.models.network_blocks.___torch_mangle_3.BaseConv = prim::GetAttr[name="dconv"](%_0.1)
  %act.3 : __torch__.torch.nn.modules.activation.___torch_mangle_2.SiLU = prim::GetAttr[name="act"](%dconv.1)
  %bn.3 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="bn"](%dconv.1)
  %conv.5 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="conv"](%dconv.1)
  %weight.439 : Tensor = prim::GetAttr[name="weight"](%conv.5)
  %78 : int[] = prim::ListConstruct(%19, %19), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.dconv/__module.backbone.backbone.dark2.0.dconv.conv
  %79 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.dconv/__module.backbone.backbone.dark2.0.dconv.conv
  %80 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.dconv/__module.backbone.backbone.dark2.0.dconv.conv
  %81 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.dconv/__module.backbone.backbone.dark2.0.dconv.conv
  %input.9 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.7, %weight.439, %12, %78, %79, %80, %11, %81, %20, %11, %11, %10, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.dconv/__module.backbone.backbone.dark2.0.dconv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %running_var.211 : Tensor = prim::GetAttr[name="running_var"](%bn.3)
  %running_mean.211 : Tensor = prim::GetAttr[name="running_mean"](%bn.3)
  %bias.229 : Tensor = prim::GetAttr[name="bias"](%bn.3)
  %weight.441 : Tensor = prim::GetAttr[name="weight"](%bn.3)
  %input.11 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::batch_norm(%input.9, %weight.441, %bias.229, %running_mean.211, %running_var.211, %11, %14, %13, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.dconv/__module.backbone.backbone.dark2.0.dconv.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %input.13 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::silu_(%input.11), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.dconv/__module.backbone.backbone.dark2.0.dconv.act # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2076:0
  %act.5 : __torch__.torch.nn.modules.activation.___torch_mangle_6.SiLU = prim::GetAttr[name="act"](%pconv.1)
  %bn.5 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_5.BatchNorm2d = prim::GetAttr[name="bn"](%pconv.1)
  %conv.7 : __torch__.torch.nn.modules.conv.___torch_mangle_4.Conv2d = prim::GetAttr[name="conv"](%pconv.1)
  %weight.443 : Tensor = prim::GetAttr[name="weight"](%conv.7)
  %93 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.pconv/__module.backbone.backbone.dark2.0.pconv.conv
  %94 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.pconv/__module.backbone.backbone.dark2.0.pconv.conv
  %95 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.pconv/__module.backbone.backbone.dark2.0.pconv.conv
  %96 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.pconv/__module.backbone.backbone.dark2.0.pconv.conv
  %input.15 : Float(1, 32, 104, 104, strides=[346112, 10816, 104, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.13, %weight.443, %12, %93, %94, %95, %11, %96, %15, %11, %11, %10, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.pconv/__module.backbone.backbone.dark2.0.pconv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %running_var.213 : Tensor = prim::GetAttr[name="running_var"](%bn.5)
  %running_mean.213 : Tensor = prim::GetAttr[name="running_mean"](%bn.5)
  %bias.231 : Tensor = prim::GetAttr[name="bias"](%bn.5)
  %weight.445 : Tensor = prim::GetAttr[name="weight"](%bn.5)
  %input.17 : Float(1, 32, 104, 104, strides=[346112, 10816, 104, 1], requires_grad=1, device=cpu) = aten::batch_norm(%input.15, %weight.445, %bias.231, %running_mean.213, %running_var.213, %11, %14, %13, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.pconv/__module.backbone.backbone.dark2.0.pconv.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %input.19 : Float(1, 32, 104, 104, strides=[346112, 10816, 104, 1], requires_grad=1, device=cpu) = aten::silu_(%input.17), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.0/__module.backbone.backbone.dark2.0.pconv/__module.backbone.backbone.dark2.0.pconv.act # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2076:0
  %conv3.1 : __torch__.yolox.models.network_blocks.___torch_mangle_19.BaseConv = prim::GetAttr[name="conv3"](%_1.1)
  %m.1 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="m"](%_1.1)
  %conv2.1 : __torch__.yolox.models.network_blocks.___torch_mangle_15.BaseConv = prim::GetAttr[name="conv2"](%_1.1)
  %conv1.1 : __torch__.yolox.models.network_blocks.___torch_mangle_11.BaseConv = prim::GetAttr[name="conv1"](%_1.1)
  %act.7 : __torch__.torch.nn.modules.activation.___torch_mangle_10.SiLU = prim::GetAttr[name="act"](%conv1.1)
  %bn.7 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_9.BatchNorm2d = prim::GetAttr[name="bn"](%conv1.1)
  %conv.9 : __torch__.torch.nn.modules.conv.___torch_mangle_8.Conv2d = prim::GetAttr[name="conv"](%conv1.1)
  %weight.447 : Tensor = prim::GetAttr[name="weight"](%conv.9)
  %112 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv1/__module.backbone.backbone.dark2.1.conv1.conv
  %113 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv1/__module.backbone.backbone.dark2.1.conv1.conv
  %114 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv1/__module.backbone.backbone.dark2.1.conv1.conv
  %115 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv1/__module.backbone.backbone.dark2.1.conv1.conv
  %input.21 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.19, %weight.447, %12, %112, %113, %114, %11, %115, %15, %11, %11, %10, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv1/__module.backbone.backbone.dark2.1.conv1.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %running_var.215 : Tensor = prim::GetAttr[name="running_var"](%bn.7)
  %running_mean.215 : Tensor = prim::GetAttr[name="running_mean"](%bn.7)
  %bias.233 : Tensor = prim::GetAttr[name="bias"](%bn.7)
  %weight.449 : Tensor = prim::GetAttr[name="weight"](%bn.7)
  %input.23 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::batch_norm(%input.21, %weight.449, %bias.233, %running_mean.215, %running_var.215, %11, %14, %13, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv1/__module.backbone.backbone.dark2.1.conv1.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %input.29 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::silu_(%input.23), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv1/__module.backbone.backbone.dark2.1.conv1.act # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2076:0
  %act.9 : __torch__.torch.nn.modules.activation.___torch_mangle_14.SiLU = prim::GetAttr[name="act"](%conv2.1)
  %bn.9 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_13.BatchNorm2d = prim::GetAttr[name="bn"](%conv2.1)
  %conv.11 : __torch__.torch.nn.modules.conv.___torch_mangle_12.Conv2d = prim::GetAttr[name="conv"](%conv2.1)
  %weight.451 : Tensor = prim::GetAttr[name="weight"](%conv.11)
  %127 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv2/__module.backbone.backbone.dark2.1.conv2.conv
  %128 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv2/__module.backbone.backbone.dark2.1.conv2.conv
  %129 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv2/__module.backbone.backbone.dark2.1.conv2.conv
  %130 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv2/__module.backbone.backbone.dark2.1.conv2.conv
  %input.25 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.19, %weight.451, %12, %127, %128, %129, %11, %130, %15, %11, %11, %10, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv2/__module.backbone.backbone.dark2.1.conv2.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %running_var.217 : Tensor = prim::GetAttr[name="running_var"](%bn.9)
  %running_mean.217 : Tensor = prim::GetAttr[name="running_mean"](%bn.9)
  %bias.235 : Tensor = prim::GetAttr[name="bias"](%bn.9)
  %weight.453 : Tensor = prim::GetAttr[name="weight"](%bn.9)
  %input.27 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::batch_norm(%input.25, %weight.453, %bias.235, %running_mean.217, %running_var.217, %11, %14, %13, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv2/__module.backbone.backbone.dark2.1.conv2.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %x_2.1 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::silu_(%input.27), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv2/__module.backbone.backbone.dark2.1.conv2.act # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2076:0
  %_0.3 : __torch__.yolox.models.network_blocks.Bottleneck = prim::GetAttr[name="0"](%m.1)
  %conv2.3 : __torch__.yolox.models.network_blocks.___torch_mangle_32.DWConv = prim::GetAttr[name="conv2"](%_0.3)
  %conv1.3 : __torch__.yolox.models.network_blocks.___torch_mangle_23.BaseConv = prim::GetAttr[name="conv1"](%_0.3)
  %act.11 : __torch__.torch.nn.modules.activation.___torch_mangle_22.SiLU = prim::GetAttr[name="act"](%conv1.3)
  %bn.11 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_21.BatchNorm2d = prim::GetAttr[name="bn"](%conv1.3)
  %conv.13 : __torch__.torch.nn.modules.conv.___torch_mangle_20.Conv2d = prim::GetAttr[name="conv"](%conv1.3)
  %weight.455 : Tensor = prim::GetAttr[name="weight"](%conv.13)
  %145 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv1/__module.backbone.backbone.dark2.1.m.0.conv1.conv
  %146 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv1/__module.backbone.backbone.dark2.1.m.0.conv1.conv
  %147 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv1/__module.backbone.backbone.dark2.1.m.0.conv1.conv
  %148 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv1/__module.backbone.backbone.dark2.1.m.0.conv1.conv
  %input.31 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.29, %weight.455, %12, %145, %146, %147, %11, %148, %15, %11, %11, %10, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv1/__module.backbone.backbone.dark2.1.m.0.conv1.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %running_var.219 : Tensor = prim::GetAttr[name="running_var"](%bn.11)
  %running_mean.219 : Tensor = prim::GetAttr[name="running_mean"](%bn.11)
  %bias.237 : Tensor = prim::GetAttr[name="bias"](%bn.11)
  %weight.457 : Tensor = prim::GetAttr[name="weight"](%bn.11)
  %input.33 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::batch_norm(%input.31, %weight.457, %bias.237, %running_mean.219, %running_var.219, %11, %14, %13, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv1/__module.backbone.backbone.dark2.1.m.0.conv1.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %input.35 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::silu_(%input.33), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv1/__module.backbone.backbone.dark2.1.m.0.conv1.act # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2076:0
  %pconv.3 : __torch__.yolox.models.network_blocks.___torch_mangle_31.BaseConv = prim::GetAttr[name="pconv"](%conv2.3)
  %dconv.3 : __torch__.yolox.models.network_blocks.___torch_mangle_27.BaseConv = prim::GetAttr[name="dconv"](%conv2.3)
  %act.13 : __torch__.torch.nn.modules.activation.___torch_mangle_26.SiLU = prim::GetAttr[name="act"](%dconv.3)
  %bn.13 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_25.BatchNorm2d = prim::GetAttr[name="bn"](%dconv.3)
  %conv.15 : __torch__.torch.nn.modules.conv.___torch_mangle_24.Conv2d = prim::GetAttr[name="conv"](%dconv.3)
  %weight.459 : Tensor = prim::GetAttr[name="weight"](%conv.15)
  %162 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.dconv/__module.backbone.backbone.dark2.1.m.0.conv2.dconv.conv
  %163 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.dconv/__module.backbone.backbone.dark2.1.m.0.conv2.dconv.conv
  %164 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.dconv/__module.backbone.backbone.dark2.1.m.0.conv2.dconv.conv
  %165 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.dconv/__module.backbone.backbone.dark2.1.m.0.conv2.dconv.conv
  %input.37 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.35, %weight.459, %12, %162, %163, %164, %11, %165, %20, %11, %11, %10, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.dconv/__module.backbone.backbone.dark2.1.m.0.conv2.dconv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %running_var.221 : Tensor = prim::GetAttr[name="running_var"](%bn.13)
  %running_mean.221 : Tensor = prim::GetAttr[name="running_mean"](%bn.13)
  %bias.239 : Tensor = prim::GetAttr[name="bias"](%bn.13)
  %weight.461 : Tensor = prim::GetAttr[name="weight"](%bn.13)
  %input.39 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::batch_norm(%input.37, %weight.461, %bias.239, %running_mean.221, %running_var.221, %11, %14, %13, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.dconv/__module.backbone.backbone.dark2.1.m.0.conv2.dconv.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %input.41 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::silu_(%input.39), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.dconv/__module.backbone.backbone.dark2.1.m.0.conv2.dconv.act # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2076:0
  %act.15 : __torch__.torch.nn.modules.activation.___torch_mangle_30.SiLU = prim::GetAttr[name="act"](%pconv.3)
  %bn.15 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_29.BatchNorm2d = prim::GetAttr[name="bn"](%pconv.3)
  %conv.17 : __torch__.torch.nn.modules.conv.___torch_mangle_28.Conv2d = prim::GetAttr[name="conv"](%pconv.3)
  %weight.463 : Tensor = prim::GetAttr[name="weight"](%conv.17)
  %177 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.pconv/__module.backbone.backbone.dark2.1.m.0.conv2.pconv.conv
  %178 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.pconv/__module.backbone.backbone.dark2.1.m.0.conv2.pconv.conv
  %179 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.pconv/__module.backbone.backbone.dark2.1.m.0.conv2.pconv.conv
  %180 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.pconv/__module.backbone.backbone.dark2.1.m.0.conv2.pconv.conv
  %input.43 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.41, %weight.463, %12, %177, %178, %179, %11, %180, %15, %11, %11, %10, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.pconv/__module.backbone.backbone.dark2.1.m.0.conv2.pconv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %running_var.223 : Tensor = prim::GetAttr[name="running_var"](%bn.15)
  %running_mean.223 : Tensor = prim::GetAttr[name="running_mean"](%bn.15)
  %bias.241 : Tensor = prim::GetAttr[name="bias"](%bn.15)
  %weight.465 : Tensor = prim::GetAttr[name="weight"](%bn.15)
  %input.45 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::batch_norm(%input.43, %weight.465, %bias.241, %running_mean.223, %running_var.223, %11, %14, %13, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.pconv/__module.backbone.backbone.dark2.1.m.0.conv2.pconv.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %y.1 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::silu_(%input.45), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0/__module.backbone.backbone.dark2.1.m.0.conv2/__module.backbone.backbone.dark2.1.m.0.conv2.pconv/__module.backbone.backbone.dark2.1.m.0.conv2.pconv.act # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2076:0
  %x_1.1 : Float(1, 16, 104, 104, strides=[173056, 10816, 104, 1], requires_grad=1, device=cpu) = aten::add(%y.1, %input.29, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.m/__module.backbone.backbone.dark2.1.m.0 # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:100:0
  %189 : Tensor[] = prim::ListConstruct(%x_1.1, %x_2.1), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1
  %input.47 : Float(1, 32, 104, 104, strides=[346112, 10816, 104, 1], requires_grad=1, device=cpu) = aten::cat(%189, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1 # /home/jiun/tmp/workplace/YOLOX-main/yolox/models/network_blocks.py:184:0
  %act.17 : __torch__.torch.nn.modules.activation.___torch_mangle_18.SiLU = prim::GetAttr[name="act"](%conv3.1)
  %bn.17 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_17.BatchNorm2d = prim::GetAttr[name="bn"](%conv3.1)
  %conv.19 : __torch__.torch.nn.modules.conv.___torch_mangle_16.Conv2d = prim::GetAttr[name="conv"](%conv3.1)
  %weight.467 : Tensor = prim::GetAttr[name="weight"](%conv.19)
  %195 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv3/__module.backbone.backbone.dark2.1.conv3.conv
  %196 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv3/__module.backbone.backbone.dark2.1.conv3.conv
  %197 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv3/__module.backbone.backbone.dark2.1.conv3.conv
  %198 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv3/__module.backbone.backbone.dark2.1.conv3.conv
  %input.49 : Float(1, 32, 104, 104, strides=[346112, 10816, 104, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.47, %weight.467, %12, %195, %196, %197, %11, %198, %15, %11, %11, %10, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv3/__module.backbone.backbone.dark2.1.conv3.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %running_var.225 : Tensor = prim::GetAttr[name="running_var"](%bn.17)
  %running_mean.225 : Tensor = prim::GetAttr[name="running_mean"](%bn.17)
  %bias.243 : Tensor = prim::GetAttr[name="bias"](%bn.17)
  %weight.469 : Tensor = prim::GetAttr[name="weight"](%bn.17)
  %input.51 : Float(1, 32, 104, 104, strides=[346112, 10816, 104, 1], requires_grad=1, device=cpu) = aten::batch_norm(%input.49, %weight.469, %bias.243, %running_mean.225, %running_var.225, %11, %14, %13, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv3/__module.backbone.backbone.dark2.1.conv3.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %input.53 : Float(1, 32, 104, 104, strides=[346112, 10816, 104, 1], requires_grad=1, device=cpu) = aten::silu_(%input.51), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark2/__module.backbone.backbone.dark2.1/__module.backbone.backbone.dark2.1.conv3/__module.backbone.backbone.dark2.1.conv3.act # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2076:0
  %_1.5 : __torch__.yolox.models.network_blocks.___torch_mangle_98.CSPLayer = prim::GetAttr[name="1"](%dark3)
  %_0.5 : __torch__.yolox.models.network_blocks.___torch_mangle_42.DWConv = prim::GetAttr[name="0"](%dark3)
  %pconv.5 : __torch__.yolox.models.network_blocks.___torch_mangle_41.BaseConv = prim::GetAttr[name="pconv"](%_0.5)
  %dconv.5 : __torch__.yolox.models.network_blocks.___torch_mangle_37.BaseConv = prim::GetAttr[name="dconv"](%_0.5)
  %act.19 : __torch__.torch.nn.modules.activation.___torch_mangle_36.SiLU = prim::GetAttr[name="act"](%dconv.5)
  %bn.19 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_35.BatchNorm2d = prim::GetAttr[name="bn"](%dconv.5)
  %conv.21 : __torch__.torch.nn.modules.conv.___torch_mangle_34.Conv2d = prim::GetAttr[name="conv"](%dconv.5)
  %weight.471 : Tensor = prim::GetAttr[name="weight"](%conv.21)
  %214 : int[] = prim::ListConstruct(%19, %19), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.dconv/__module.backbone.backbone.dark3.0.dconv.conv
  %215 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.dconv/__module.backbone.backbone.dark3.0.dconv.conv
  %216 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.dconv/__module.backbone.backbone.dark3.0.dconv.conv
  %217 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.dconv/__module.backbone.backbone.dark3.0.dconv.conv
  %input.55 : Float(1, 32, 52, 52, strides=[86528, 2704, 52, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.53, %weight.471, %12, %214, %215, %216, %11, %217, %21, %11, %11, %10, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.dconv/__module.backbone.backbone.dark3.0.dconv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %running_var.227 : Tensor = prim::GetAttr[name="running_var"](%bn.19)
  %running_mean.227 : Tensor = prim::GetAttr[name="running_mean"](%bn.19)
  %bias.245 : Tensor = prim::GetAttr[name="bias"](%bn.19)
  %weight.473 : Tensor = prim::GetAttr[name="weight"](%bn.19)
  %input.57 : Float(1, 32, 52, 52, strides=[86528, 2704, 52, 1], requires_grad=1, device=cpu) = aten::batch_norm(%input.55, %weight.473, %bias.245, %running_mean.227, %running_var.227, %11, %14, %13, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.dconv/__module.backbone.backbone.dark3.0.dconv.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %input.59 : Float(1, 32, 52, 52, strides=[86528, 2704, 52, 1], requires_grad=1, device=cpu) = aten::silu_(%input.57), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.dconv/__module.backbone.backbone.dark3.0.dconv.act # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2076:0
  %act.21 : __torch__.torch.nn.modules.activation.___torch_mangle_40.SiLU = prim::GetAttr[name="act"](%pconv.5)
  %bn.21 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_39.BatchNorm2d = prim::GetAttr[name="bn"](%pconv.5)
  %conv.23 : __torch__.torch.nn.modules.conv.___torch_mangle_38.Conv2d = prim::GetAttr[name="conv"](%pconv.5)
  %weight.475 : Tensor = prim::GetAttr[name="weight"](%conv.23)
  %229 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.pconv/__module.backbone.backbone.dark3.0.pconv.conv
  %230 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.pconv/__module.backbone.backbone.dark3.0.pconv.conv
  %231 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.pconv/__module.backbone.backbone.dark3.0.pconv.conv
  %232 : int[] = prim::ListConstruct(%18, %18), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.pconv/__module.backbone.backbone.dark3.0.pconv.conv
  %input.61 : Float(1, 64, 52, 52, strides=[173056, 2704, 52, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.59, %weight.475, %12, %229, %230, %231, %11, %232, %15, %11, %11, %10, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.pconv/__module.backbone.backbone.dark3.0.pconv.conv # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:459:0
  %running_var.229 : Tensor = prim::GetAttr[name="running_var"](%bn.21)
  %running_mean.229 : Tensor = prim::GetAttr[name="running_mean"](%bn.21)
  %bias.247 : Tensor = prim::GetAttr[name="bias"](%bn.21)
  %weight.477 : Tensor = prim::GetAttr[name="weight"](%bn.21)
  %input.63 : Float(1, 64, 52, 52, strides=[173056, 2704, 52, 1], requires_grad=1, device=cpu) = aten::batch_norm(%input.61, %weight.477, %bias.247, %running_mean.229, %running_var.229, %11, %14, %13, %10), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.pconv/__module.backbone.backbone.dark3.0.pconv.bn # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2483:0
  %input.65 : Float(1, 64, 52, 52, strides=[173056, 2704, 52, 1], requires_grad=1, device=cpu) = aten::silu_(%input.63), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.0/__module.backbone.backbone.dark3.0.pconv/__module.backbone.backbone.dark3.0.pconv.act # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2076:0
  %conv3.3 : __torch__.yolox.models.network_blocks.___torch_mangle_54.BaseConv = prim::GetAttr[name="conv3"](%_1.5)
  %m.3 : __torch__.torch.nn.modules.container.___torch_mangle_97.Sequential = prim::GetAttr[name="m"](%_1.5)
  %conv2.5 : __torch__.yolox.models.network_blocks.___torch_mangle_50.BaseConv = prim::GetAttr[name="conv2"](%_1.5)
  %conv1.5 : __torch__.yolox.models.network_blocks.___torch_mangle_46.BaseConv = prim::GetAttr[name="conv1"](%_1.5)
  %act.23 : __torch__.torch.nn.modules.activation.___torch_mangle_45.SiLU = prim::GetAttr[name="act"](%conv1.5)
  %bn.23 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_44.BatchNorm2d = prim::GetAttr[name="bn"](%conv1.5)
  %conv.25 : __torch__.torch.nn.modules.conv.___torch_mangle_43.Conv2d = prim::GetAttr[name="conv"](%conv1.5)
  %weight.479 : Tensor = prim::GetAttr[name="weight"](%conv.25)
  %248 : int[] = prim::ListConstruct(%15, %15), scope: __module.backbone/__module.backbone.backbone/__module.backbone.backbone.dark3/__module.backbone.backbone.dark3.1/__module.backbone.backbone.dark3.1.conv1/__module.backbone.backbone.dark3.1.conv1.conv
